DataProcessors/ИмпортЗаказовИзЭксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИмпортЗаказовИзЭксель</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛМ_КонтрагентыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛМ_КонтрагентыДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетДляРасчетовСФСС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИспользованияЗвит1С</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючАПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПользователяИнтернет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьОтправкиПервойЕдиницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьОтправкиДополнительнойЕдиницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ОписанияГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьОтправкиПервойЕдиницыУкрпочта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьОтправкиДополнительнойЕдиницыУкрпочта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛМ_КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛМ_Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛМ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ТипыКонтрагентовОтправителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИмпортЗаказовИзЭксель/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	ДиалогВыбораФайла.ПолноеИмяФайла = ""; 
	
	ДиалогВыбораФайла.Фильтр = "(*.xlsx)|*.xlsx|(*.xls)|*.xls"; 
	ДиалогВыбораФайла.Заголовок = "Выберите файл для загрузки"; 
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайлаЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПерваяЗначимаяСтрока = 2; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаказы(Команда)
	
	Если ПустаяСтрока(ИмяФайлаЗагрузки) Тогда
		Предупреждение("Не выбран файл. Загрузка прервана"); 
		Возврат; 
	КонецЕсли; 
	
	ЗагрузитьЗаказыНаСервере(); 
	
	Предупреждение("Заказы загружены",  , "Загрузка"); 
	
КонецПроцедуры

&НаСервере
Функция  ЧислоИз(СтрокаЧ)
	Чис = "";
	Для Стр = 1 По СтрДлина(СтрокаЧ) Цикл
		Сим =Сред(СтрокаЧ,Стр,1);
		Если Сим = "0" ИЛИ Сим = "1"  ИЛИ Сим = "2" ИЛИ Сим = "3" ИЛИ Сим = "4" ИЛИ Сим = "5" ИЛИ Сим = "6"
			ИЛИ Сим = "7" ИЛИ Сим = "8" ИЛИ Сим = "9" ИЛИ Сим = "." ИЛИ Сим = "," Тогда
			Чис = Чис+Сим;
		КонецЕсли;
	КонецЦикла;
	Попытка
		Возврат Число(Чис)
	Исключение
		Возврат 0;
	КонецПопытки;
КонецФункции

Процедура ЗагрузитьЗаказыНаСервере()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;
	
	Книга = Эксель.WorkBooks.Open(ИмяФайлаЗагрузки);
	Лист = Книга.WorkSheets(1);
	
	ВсегоКолонок = Лист.Cells(1,1).SpecialCells(11).Column; 
	ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	
	ТаблицаЗаказов = Новый ТаблицаЗначений; 
	ТаблицаЗаказов.Колонки.Добавить("Телефон"); 
	ТаблицаЗаказов.Колонки.Добавить("Город"); 
	ТаблицаЗаказов.Колонки.Добавить("Контрагент"); 
	ТаблицаЗаказов.Колонки.Добавить("НомерОтделения"); 
	ТаблицаЗаказов.Колонки.Добавить("Плательщик"); 
	ТаблицаЗаказов.Колонки.Добавить("ВидРасчетов"); 
	ТаблицаЗаказов.Колонки.Добавить("ОбратнаяДоставка"); 
	ТаблицаЗаказов.Колонки.Добавить("ТипОбратнойДоставки"); 
	ТаблицаЗаказов.Колонки.Добавить("Сумма"); 
	ТаблицаЗаказов.Колонки.Добавить("ПлательщикОбратнойДоставки"); 
	ТаблицаЗаказов.Колонки.Добавить("КоличествоМест"); 
	ТаблицаЗаказов.Колонки.Добавить("Вес"); 
	ТаблицаЗаказов.Колонки.Добавить("ОбъявленнаяСтоимость");
	ТаблицаЗаказов.Колонки.Добавить("Номенклатура");
	ТаблицаЗаказов.Колонки.Добавить("Количество");
	ТаблицаЗаказов.Колонки.Добавить("ОписаниеГруза");
	ТаблицаЗаказов.Колонки.Добавить("Организация");
	ТаблицаЗаказов.Колонки.Добавить("АдресДоставки");
	ТаблицаЗаказов.Колонки.Добавить("Комментарий");
	ТаблицаЗаказов.Колонки.Добавить("НомерТТН");



	
	Для Строка = ПерваяЗначимаяСтрока По ВсегоСтрок Цикл
		КонтрагентПроверки = Лист.Cells(Строка, 3).Value; 
		Если ПустаяСтрока(КонтрагентПроверки) Тогда
			Продолжить; //Пустая Строка 
		КонецЕсли; 
		НоваяСтрока = ТаблицаЗаказов.Добавить(); 
		НоваяСтрока.Телефон 					= Лист.Cells(Строка, 1).Value; 
		НоваяСтрока.Город 						= Лист.Cells(Строка, 2).Value; 
		НоваяСтрока.Контрагент 					= Лист.Cells(Строка, 3).Value; 
		НоваяСтрока.НомерОтделения 				= Лист.Cells(Строка, 4).Value;
		НоваяСтрока.Плательщик 					= Лист.Cells(Строка, 5).Value;
		НоваяСтрока.ВидРасчетов 				= Лист.Cells(Строка, 6).Value;
		НоваяСтрока.ОбратнаяДоставка 			= Лист.Cells(Строка, 7).Value;
		НоваяСтрока.ТипОбратнойДоставки 		= Лист.Cells(Строка, 8).Value;
		НоваяСтрока.Сумма 						= ЧислоИз(Лист.Cells(Строка, 9).Value);
		НоваяСтрока.ПлательщикОбратнойДоставки 	= Лист.Cells(Строка, 10).Value;
		НоваяСтрока.КоличествоМест 				= Лист.Cells(Строка, 11).Value;
		НоваяСтрока.Вес 						= Лист.Cells(Строка, 12).Value;
		НоваяСтрока.ОбъявленнаяСтоимость 		= Лист.Cells(Строка, 13).Value;
		НоваяСтрока.Номенклатура 				= Лист.Cells(Строка, 14).Value;
		НоваяСтрока.Количество	 				= Лист.Cells(Строка, 15).Value;
		НоваяСтрока.ОписаниеГруза 				= Лист.Cells(Строка, 16).Value;
		НоваяСтрока.Организация 				= Лист.Cells(Строка, 17).Value;
		НоваяСтрока.АдресДоставки 				= Лист.Cells(Строка, 18).Value;
		НоваяСтрока.Комментарий 				= Лист.Cells(Строка, 19).Value;
		НоваяСтрока.НомерТТН 					= Лист.Cells(Строка, 20).Value;

	КонецЦикла; 
	
	Эксель.Application.Quit();

	//Создание заказов
	
	Для Каждого Стр Из ТаблицаЗаказов Цикл
		ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент(); 
		ИнициализироватьДокументЗаказ(ДокументОбъект); 
		ДокументОбъект.Дата = ТекущаяДата(); 
		Орг = Справочники.Организации.НайтиПоНаименованию(Стр.Организация);
		Организация = Орг;
		Если Орг = Справочники.Организации.ПустаяСсылка() Тогда
			Сообщить("Строка пропущена, не найдена организация "+Стр.Организация);
			Продолжить;
		КонецЕсли;
		ДокументОбъект.Организация = Орг; 
		ДокументОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
		ДокументОбъект.КурсВзаиморасчетов = 1; 
		ДокументОбъект.КратностьВзаиморасчетов = 1;
		ДокументОбъект.НомерТТН = СтрЗаменить(Стр.НомерТТН,Символы.НПП,"");
		
		ДокументОбъект.Комментарий =  СокрЛП(Стр.Комментарий)+" Адрес: "+СокрЛП(Стр.АдресДоставки);
		
		ДокументОбъект.Контрагент = ПолучитьСоздатьКонтрагента(Стр); 
		ДокументОбъект.ДоговорКонтрагента = ПолучитьДоговор(ДокументОбъект.Контрагент); 
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
			ДокументОбъект.УстановитьНовыйНомер(Организация.Префикс); 
		КонецЕсли; 
		
		ДокументОбъект.Страховка200 = НЕ ЗначениеЗаполнено(Стр.Сумма); 
		ДокументОбъект.Вес = Стр.Вес; 
		ДокументОбъект.ТипОбратнойДоставки = ПолучитьТипОбратнойДоставки(Стр); 
		ДокументОбъект.Мест = Стр.КоличествоМест;
		ДокументОбъект.СтатусЗаказа = Справочники.СтатусыЗаказов.НайтиПоКоду("000000002"); //Ожидает отправки 
		ДокументОбъект.ВидРасчетов = ПолучитьВидРасчетов(Стр.ВидРасчетов); 
		ДокументОбъект.ПлательщикОбратнойДоставки = ПолучитьПлательщикаОбратнойДоставки(Стр.ПлательщикОбратнойДоставки); 
		ДокументОбъект.Плательщик = ПолучитьПлательщика(Стр.Плательщик); 
		ДокументОбъект.СпособОтправки = Справочники.СпособыОтправки.НоваяПочта; 
		//ДокументОбъект.СуммаНоваяПочта = Стр.ОбъявленнаяСтоимость; 
		ДокументОбъект.ТехнологияДоставки = Справочники.ЛМ_ТехнологииДоставки.НайтиПоКоду("000000003"); 
		ДокументОбъект.ГородНовойПочтыЗначение = ПолучитьГородНовойПочты(Стр.Город); 
		ДокументОбъект.СкладНовойПочтыЗначение = ПолучитьОтделениеНовойПочты(ДокументОбъект.ГородНовойПочтыЗначение, Стр.НомерОтделения); 
		ДокументОбъект.КонтрагентДоставки = ПолучитьСоздатьКонтрагентаДоставки(ДокументОбъект.Контрагент, ДокументОбъект.ГородНовойПочтыЗначение, ДокументОбъект.СкладНовойПочтыЗначение, Стр.Телефон); 
		ДокументОбъект.КонтактноеЛицоДоставки = ПолучитьСоздатьКонтактноеЛицоДоставки(ДокументОбъект.Контрагент, ДокументОбъект.КонтрагентДоставки, Стр.Телефон);                                                        
		//Таб часть 
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		
		НайденаНоменклатура =  Справочники.Номенклатура.НайтиПоНаименованию(Стр.Номенклатура);
		Если НайденаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
			Номенклатура.Наименование = Стр.Номенклатура;
			Номенклатура.НаименованиеПолное = Стр.Номенклатура;
			Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001");
			Номенклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
			Номенклатура.Записать();
			//единицы
			Ед = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			Ед.Владелец = Номенклатура.Ссылка;
			Ед.Наименование = Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
			Ед.Коэффициент = 1;
			Ед.Записать();
			Номенклатура.ЕдиницаДляОтчетов = Ед.Ссылка;
			Номенклатура.ЕдиницаИзмеренияМест = Ед.Ссылка;
			Номенклатура.ЕдиницаХраненияОстатков = Ед.Ссылка;
			Номенклатура.Записать();
			НайденаНоменклатура = Номенклатура.Ссылка;
		КонецЕсли;

		НоваяСтрока.Номенклатура = НайденаНоменклатура; 
		
		ДокументОбъект.ПриИзмененииНоменклатурыТоваров(НоваяСтрока);
		Попытка
			Кол = Число(Стр.Количество);
		Исключение
			Кол = 1;
		КонецПопытки;
		НоваяСтрока.Количество = Кол; 
		НоваяСтрока.Цена = ?(ЗначениеЗаполнено(Стр.Сумма), Стр.Сумма, 300); 
		НоваяСтрока.Сумма = ?(ЗначениеЗаполнено(Стр.Сумма), Стр.Сумма, 300); 
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументОбъект); 
		
		ДокументОбъект.Записать(); 
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьПлательщика(Плательщик)
	
	Если НЕ ЗначениеЗаполнено(Плательщик) Тогда
		Возврат Неопределено; 
	КонецЕсли; 
	
	Если Найти(Плательщик, "відправник") > 0 ИЛИ Найти(Плательщик, "отправитель") > 0 Тогда 
		Возврат Справочники.ЛМ_ВидыПлательщиков.НайтиПоКоду("000000001"); 
	Иначе 
		Возврат Справочники.ЛМ_ВидыПлательщиков.НайтиПоКоду("000000002"); 
	КонецЕсли;
КонецФункции
 
Функция ПолучитьТипОбратнойДоставки(СтрокаЗаказа)
	Если НЕ ЗначениеЗаполнено(СтрокаЗаказа.Сумма)Тогда
		Возврат Справочники.ЛМ_ВидыОбратнойДоставки.ПустаяСсылка(); 
	ИначеЕсли НРег(СтрокаЗаказа.ОбратнаяДоставка) = "ні" Тогда
		Возврат Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000007"); //Предоплата на карту 
	ИначеЕсли НРег(СтрокаЗаказа.ТипОбратнойДоставки) = "контроль оплати" Тогда 
		Возврат Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000005");
	Иначе 
		Возврат Справочники.ЛМ_ВидыОбратнойДоставки.НайтиПоКоду("000000002"); //Ценные бумаги
	КонецЕсли; 
КонецФункции
 
Функция ПолучитьСоздатьКонтактноеЛицоДоставки(Контрагент, КонтрагентДоставки, Телефон)
	
	Если Контрагент.Пустая() ИЛИ КонтрагентДоставки.Пустая() Тогда
		Возврат Ложь; 
	КонецЕсли; 
	
	ФИО = Контрагент.Наименование; 
	Фамилия = ВыделитьСлово(ФИО); 
	Имя = ВыделитьСлово(ФИО); 
	Отчество = ВыделитьСлово(ФИО); 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
	|ГДЕ
	|	ЛМ_КонтактныеЛица.Владелец = &Владелец
	|	И ЛМ_КонтактныеЛица.Имя = &Имя
	|	И ЛМ_КонтактныеЛица.Фамилия = &Фамилия
	|	И ЛМ_КонтактныеЛица.Отчество = &Отчество"; 
	Запрос.УстановитьПараметр("Владелец", КонтрагентДоставки); 
	Запрос.УстановитьПараметр("Имя", Имя); 
	Запрос.УстановитьПараметр("Фамилия", Фамилия); 
	Запрос.УстановитьПараметр("Отчество", Отчество); 
	Результат = Запрос.Выполнить().Выбрать(); 
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка; 
	КонецЕсли; 
	
	Об = Справочники.ЛМ_КонтактныеЛица.СоздатьЭлемент();
	Об.Владелец = КонтрагентДоставки;
	Об.Имя = Имя;
	Об.Фамилия = Фамилия;
	Об.Отчество = Отчество;
	Об.Телефон = Телефон;
	Об.Записать();
	
	Возврат об.Ссылка; 

КонецФункции
 
Функция ПолучитьСоздатьКонтрагентаДоставки(Контрагент, Город, Склад, Телефон)
	
	Если Контрагент.Пустая() Тогда
		Возврат Ложь; 
	КонецЕсли; 
	
	//Поиск контрагента в регистре 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
	|ИЗ
	|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
	|ГДЕ
	|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент"; 
	Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	Результат = Запрос.Выполнить().Выбрать(); 
	Если Результат.Следующий() Тогда
		Возврат Результат.КонтрагентДоставки; 
	КонецЕсли; 
	//Создание контрагента 
	ФИО = Контрагент.Наименование; 
	
	Фамилия = ВыделитьСлово(ФИО); 
	Имя = ВыделитьСлово(ФИО); 
	Отчество = ВыделитьСлово(ФИО); 
	
	ОбКонтрагент = Справочники.ЛМ_Контрагенты.СоздатьЭлемент();
	ОбКонтрагент.Город = Город;
	ОбКонтрагент.СкладПоУмолчанию = Склад;
	ОбКонтрагент.Наименование = Контрагент.Наименование;
	ОбКонтрагент.ВидКонтрагента = Справочники.ЛМ_ВидыПлательщиков.НайтиПоРеквизиту("ГУИД", "Recipient");
	ОбКонтрагент.Имя = Имя;
	ОбКонтрагент.Фамилия = Фамилия;
	ОбКонтрагент.Отчество = Отчество;
	ОбКонтрагент.Телефон = Телефон; 
	//Если ЮрФизЛицо =Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
	//	ОбКонтрагент.ЮрФизЛицо = Справочники.ЛМ_ТипыКонтрагентовОтправителей.НайтиПоРеквизиту("ГУИД", "Organization");
	//	ОбКонтрагент.ЕДРПОУ = КодЕДРПОУ;
	//	ОбКонтрагент.ФормаСобственности = ФормаСобственности;
	//Иначе	
		ОбКонтрагент.ЮрФизЛицо = Справочники.ЛМ_ТипыКонтрагентовОтправителей.НайтиПоРеквизиту("ГУИД", "PrivatePerson");
	//КонецЕсли;
//	ОбКонтрагент.Организация = Организация;
	ОбКонтрагент.Записать();
	
	НЗ = РегистрыСведений.ЛМ_КонтрагентыДоставки.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Контрагент.Ссылка);
	НЗ.Отбор.КонтрагентДоставки.Установить(ОбКонтрагент.Ссылка);
	З = НЗ.Добавить();
	З.Контрагент = Контрагент.Ссылка;
	З.КонтрагентДоставки = ОбКонтрагент.Ссылка;
	НЗ.Записать();

	Возврат ОбКонтрагент.Ссылка; 
	
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока  = СокрЛП(Сред(ИсходнаяСтрока, ПозицияПослПробела + 1));
	
	Возврат ВыделенноеСлово;
	
КонецФункции

Функция ПолучитьОтделениеНовойПочты(Город, НомерОтделения)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_Отделения.Ссылка
	|ИЗ
	|	Справочник.ЛМ_Отделения КАК ЛМ_Отделения
	|ГДЕ
	|	ЛМ_Отделения.Номер = &Номер
	|	И ЛМ_Отделения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Город); 
	Запрос.УстановитьПараметр("Номер", НомерОтделения); 
	
	Результат = Запрос.Выполнить().Выбрать(); 
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка; 
	КонецЕсли;
КонецФункции

Функция ПолучитьГородНовойПочты(Город)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_Города.Ссылка
	|ИЗ
	|	Справочник.ЛМ_Города КАК ЛМ_Города
	|ГДЕ
	|	(ЛМ_Города.Наименование = &Наименование
	|			ИЛИ ЛМ_Города.НаименованиеРусское = &Наименование)";
	Запрос.УстановитьПараметр("Наименование", Город); 
	Результат = Запрос.Выполнить().Выбрать(); 
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка; 
	КонецЕсли; 
	
КонецФункции
 
Функция ПолучитьПлательщикаОбратнойДоставки(Знач Плательщик); 
	
	Плательщик = НРег(Плательщик); 
	Если ПустаяСтрока(Плательщик) Тогда
		Возврат Справочники.ЛМ_ВидыПлательщиковОбратнойДоставки.ПустаяСсылка(); 
	ИначеЕсли Найти(Плательщик, "відправник") > 0 ИЛИ Найти(Плательщик, "отправитель") > 0 Тогда 
		Возврат Справочники.ЛМ_ВидыПлательщиковОбратнойДоставки.НайтиПоКоду("000000001"); 
	Иначе 
		Возврат Справочники.ЛМ_ВидыПлательщиковОбратнойДоставки.НайтиПоКоду("000000002"); 
	КонецЕсли; 
КонецФункции
 
Функция ПолучитьВидРасчетов(Знач ВидРасчетов)
	
	ВидРасчетов = НРег(ВидРасчетов); 
	Если ПустаяСтрока(ВидРасчетов) Тогда
		Возврат Справочники.ЛМ_ФормыОплаты.ПустаяСсылка(); 
	ИначеЕсли Найти(ВидРасчетов, "безготівковий") > 0 ИЛИ Найти(ВидРасчетов, "безналичный") > 0 Тогда 
		Возврат Справочники.ЛМ_ФормыОплаты.НайтиПоКоду("000000001"); 
	Иначе
		Возврат Справочники.ЛМ_ФормыОплаты.НайтиПоКоду("000000002"); 
	КонецЕсли; 
КонецФункции
 
Функция ПолучитьДоговор(Контрагент)
	
	Возврат ОбщегоНазначения.ПолучитьОсновнойДоговорКонтрагента(Контрагент);

КонецФункции
 
Функция ПолучитьСоздатьКонтрагента(СтрокаЗаказа)
	
	ФИОКонтрагента = СтрокаЗаказа.Контрагент; 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование"; 
	Запрос.УстановитьПараметр("Наименование", ФИОКонтрагента); 
	Результат = Запрос.Выполнить().Выбрать(); 
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка; 
	КонецЕсли; 
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
	НовыйКонтрагент.Наименование = ФИОКонтрагента; 
	НовыйКонтрагент.НаименованиеПолное = ФИОКонтрагента; 
	НовыйКонтрагент.Покупатель = Истина; 
	
	НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо; 
	НовыйКонтрагент.ГруппаДоступаККонтрагенту  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяГруппаДоступаККонтрагенту");	
	
	НачатьТранзакцию();
	
	ФиксироватьТранзакцию = Истина;
	
	НовыйКонтрагент.УстановитьНовыйКод();
	ФормаКонтрагента = НовыйКонтрагент.ПолучитьФорму(,  ЭтаФорма);
	ФормаКонтрагента.НаборКонтактнойИнформации.Отбор.Объект.Установить(НовыйКонтрагент.Ссылка);
	
	Если ЗначениеЗаполнено(СтрокаЗаказа.Телефон) Тогда
		
		
		НоваяЗапись = ФормаКонтрагента.НаборКонтактнойИнформации.Добавить();
		
		НоваяЗапись.Вид    = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НоваяЗапись.Тип    = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Объект = НовыйКонтрагент.Ссылка;
		
		НоваяЗапись.Поле3  = СтрокаЗаказа.Телефон;
				
		УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(НоваяЗапись);
		
	КонецЕсли; 

	Попытка
		ФормаКонтрагента.ЗаписатьВФорме();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать контрагента: " + ОписаниеОшибки());
		ФиксироватьТранзакцию = Ложь;
	КонецПопытки;
	
	// если не записали ничего - значит проблемы возникли
	Если ФормаКонтрагента.Модифицированность Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать контрагента.");
		ФиксироватьТранзакцию = Ложь;	
	КонецЕсли;
	
	Если ФиксироватьТранзакцию = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли 	ФиксироватьТранзакцию = истина Тогда 
		ЗафиксироватьТранзакцию();
		Возврат НовыйКонтрагент.Ссылка;
	Иначе
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;

КонецФункции
 
Функция ИнициализироватьДокументЗаказ(ДокументОбъект)
	
	ДокументОбъект.ИнициализироватьНовыйДокумент(Неопределено, Неопределено);
	
	Возврат Истина;
	
КонецФункции
